/*
* map 
* 0 为空
* 1 为移动块显示的小方块
* 
* 二维数组为 当前移动块可变换的最小所需空间
*/
/*
* info 详情
*   h 二维数组高度
*   len 二维数组长度
*   l 左侧空格行数
*   r 右部空格行数
*   t 顶部空格行数
*   b 底部空格行数
*/
// 当前控制的模块
// long
var longMap = [
  {
    map: [
      [0, 0, 0, 0],
      [1, 1, 1, 1],
      [0, 0, 0, 0],
      [0, 0, 0, 0]
    ],
    info: {
      h: 4,
      t: 1,
      b: 2,
      len: 4
    }

  },
  {
    map: [
      [0, 1, 0, 0],
      [0, 1, 0, 0],
      [0, 1, 0, 0],
      [0, 1, 0, 0]
    ],
    info: {
      h: 4,
      l: 1,
      r: 2,
      len: 4
    }
  }
]

// L
var lMap = [
  {
    map: [
      [1, 0, 0],
      [1, 1, 1],
      [0, 0, 0]
    ],
    info: {
      h: 3,
      b: 1,
      len: 3
    }
  },
  {
    map: [
      [0, 1, 1],
      [0, 1, 0],
      [0, 1, 0]
    ],
    info: {
      h: 3,
      l: 1,
      len: 3
    }
  },
  {
    map: [
      [0, 0, 0],
      [1, 1, 1],
      [0, 0, 1]
    ],
    info: {
      h: 3,
      t: 1,
      len: 3
    }
  },
  {
    map: [
      [0, 1, 0],
      [0, 1, 0],
      [1, 1, 0]
    ],
    info: {
      h: 3,
      r: 1,
      len: 3
    }
  }
]

// r L
var rLMap = [
  {
    map: [
      [0, 0, 1],
      [1, 1, 1],
      [0, 0, 0]
    ],
    info: {
      h: 3,
      b: 1,
      len: 3
    }
  },
  {
    map: [
      [0, 1, 0],
      [0, 1, 0],
      [0, 1, 1]
    ],
    info: {
      h: 3,
      l: 1,
      len: 3
    }
  },
  {
    map: [
      [0, 0, 0],
      [1, 1, 1],
      [1, 0, 0]
    ],
    info: {
      h: 3,
      t: 1,
      len: 3
    }
  },
  {
    map: [
      [1, 1, 0],
      [0, 1, 0],
      [0, 1, 0]
    ],
    info: {
      h: 3,
      r: 1,
      len: 3
    }
  }
]

// z
var zMap = [

  {
    map: [
      [0, 0, 0],
      [1, 1, 0],
      [0, 1, 1]
    ],
    info: {
      h: 3,
      t: 1,
      len: 3
    }
  },
  {
    map: [
      [0, 1, 0],
      [1, 1, 0],
      [1, 0, 0]
    ],
    info: {
      h: 3,
      r: 1,
      len: 3
    }
  }
]

// r z
var rZMap = [
  {
    map: [
      [0, 0, 0],
      [0, 1, 1],
      [1, 1, 0]
    ],
    info: {
      h: 3,
      t: 1,
      len: 3
    }
  },
  {
    map: [
      [0, 1, 0],
      [0, 1, 1],
      [0, 0, 1]
    ],
    info: {
      h: 3,
      l: 1,
      len: 3
    }
  }
]

// 田
var tianMap = [

  {
    map: [
      [1, 1],
      [1, 1]
    ],
    info: {
      h: 2,
      len: 2
    }
  }
]

// 山
var sanMap = [
  {
    map: [
      [0, 1, 0],
      [1, 1, 1],
      [0, 0, 0]
    ],
    info: {
      h: 3,
      b: 1,
      len: 3
    }
  },
  {
    map: [
      [0, 1, 0],
      [0, 1, 1],
      [0, 1, 0]
    ],
    info: {
      h: 3,
      l: 1,
      len: 3
    }
  },

  {
    map: [
      [0, 0, 0],
      [1, 1, 1],
      [0, 1, 0]
    ],
    info: {
      h: 3,
      t: 1,
      len: 3
    }
  },
  {
    map: [
      [0, 1, 0],
      [1, 1, 0],
      [0, 1, 0]
    ],
    info: {
      r: 1,
      len: 3
    }
  }

]

export default {
  longMap,
  lMap,
  rLMap,
  zMap,
  rZMap,
  tianMap,
  sanMap
}
